{
  "version": "3.2.0",
  "lastUpdated": "2026-02-16T00:00:00Z",
  "schemaVersion": "1.0",
  "changelog": [
    {
      "version": "3.2.0",
      "date": "2026-02-16",
      "type": "minor",
      "summary": "Added politics-coach skill, stakeholder avatars framework, and Org-Survival company-context layer (power, alliances, stakeholder games, red flags). Updated ORCHESTRATION and MEMORY to route politics-related queries through avatars and Org-Survival docs, and wired initiative stakeholders/ docs to this political layer. Normalized language for organization and communication across core docs."
    },
    {
      "version": "3.1.0",
      "date": "2026-02-16",
      "type": "minor",
      "summary": "Human docs moved to docs/ (setup, guidelines, architecture, credits, agent-manifest). Added Design Principles and Naming conventions to docs/architecture.md. README restructured as single entry point for humans, agents, and forkers. MEMORY.md wake trigger for repo structure/architecture topics. ORCHESTRATION.md: check filesystem before asking user about context. Renamed BRIER-CALCULATION.md to brier-calculation.md. All cross-references updated."
    },
    {
      "version": "3.0.0",
      "date": "2026-02-13",
      "type": "major",
      "summary": "Platform-agnostic core and context rot prevention. AGENTS.md and ORCHESTRATION.md no longer reference .cursor/ paths directly; MEMORY.md is now the single path-mapping layer for platform-specific files (rules, skills, evals). Added Context Health section to ORCHESTRATION.md (heuristic-based checkpointing, re-anchoring, error recovery). Created CLAUDE.md for Claude Code. Added checkpoints/ folder for session state persistence. Updated SETUP.md with multi-platform setup guide."
    },
    {
      "version": "2.2.0",
      "date": "2026-02-13",
      "type": "minor",
      "summary": "Added communication style / voice layer. Agent now speaks with direct, experience-backed, prose-first personality. New voice.mdc (alwaysApply). Updated Core Persona in AGENTS.md and state-specific personas in 0-start-here-product-thinking.md. DevX===UX recurring theme added."
    },
    {
      "version": "2.1.0",
      "date": "2026-02-04",
      "type": "minor",
      "summary": "Added eval test generator and seeded test cases; introduced specialized skills (discovery-research, strategy-planning, stakeholder-management); added common slash commands; wired optional post-conversation eval logging hook; updated MEMORY and eval docs."
    },
    {
      "version": "2.0.0",
      "date": "2026-02-03",
      "type": "major",
      "summary": "Simplified orchestration: all agent decision logic now in ORCHESTRATION.md. Explicit state machine with clear transitions. AGENTS.md slimmed to persona and pointer to ORCHESTRATION. Sleeping memory manifest (MEMORY.md) added for context loading (company, initiatives, research, rules, skills)."
    },
    {
      "version": "1.1.0",
      "date": "2026-02-03",
      "type": "minor",
      "summary": "Product sense is now an integrated, first-class part of the repo: the agent orchestrates three modes (product_sense, execution_mode, meta_reflection), enforces braindump-before-structure, and uses a two-level evaluation system plus \"For Agents\" sections in 14 frameworks to guide user thinking and artifact quality end-to-end."
    },
    {
      "version": "1.0.0",
      "date": "2026-02-03",
      "type": "initial",
      "summary": "Initial version with complete framework library (14 frameworks), agent instructions (AGENTS.md), eval system (Level 1 & Level 2), 6 rules, 1 skill, and architecture documentation"
    }
  ],
  "breakingChanges": [
    "AGENTS.md and ORCHESTRATION.md no longer contain .cursor/ paths; all platform-specific paths now routed through MEMORY.md",
    "MEMORY.md now includes Evals section as path-mapping layer for eval functions, behavior guide, and test infrastructure",
    "Context Health section added to ORCHESTRATION.md: heuristic checkpointing, re-anchoring at state transitions, error recovery",
    "New file: CLAUDE.md (Claude Code adapter); new folder: checkpoints/ (session state persistence)",
    "SETUP.md Step 7 rewritten as multi-platform setup guide (Cursor, Claude Code, Claude.ai, ChatGPT, GitHub Copilot, universal)"
  ],
  "structure": {
    "frameworks": 14,
    "rules": 7,
    "skills": 5,
    "evalSystem": true,
    "orchestrationFile": true,
    "memoryManifest": true,
    "platformAdapters": ["CLAUDE.md"],
    "contextHealth": true,
    "checkpoints": true,
    "agentInstructions": {
      "states": ["product_sense", "execution_mode", "meta_reflection", "conversation"],
      "evalCheckpoints": 4,
      "forAgentsSections": 14
    },
    "versionManagement": true
  }
}
